CSI API ETABS v1
cPropFrame.GetPropFileNameList Method
 Retrieves the names of all defined frame section properties of a specified type in a specified frame section property file.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPropFileNameList(
	string FileName,
	ref int NumberNames,
	ref string[] MyName,
	ref eFramePropType[] MyPropType,
	eFramePropType PropType =
)
Function GetPropFileNameList (
	FileName As String,
	ByRef NumberNames As Integer,
	ByRef MyName As String(),
	ByRef MyPropType As eFramePropType(),
	Optional PropType As eFramePropType =
) As Integer
Dim instance As cPropFrame
Dim FileName As String
Dim NumberNames As Integer
Dim MyName As String()
Dim MyPropType As eFramePropType()
Dim PropType As eFramePropType
Dim returnValue As Integer
returnValue = instance.GetPropFileNameList(FileName,
	NumberNames, MyName, MyPropType,
	PropType)
int GetPropFileNameList(
	String^ FileName,
	int% NumberNames,
	array<String^>^% MyName,
	array<eFramePropType>^% MyPropType,
	eFramePropType PropType =
)
abstract GetPropFileNameList :
        FileName : string *
        NumberNames : int byref *
        MyName : string[] byref *
        MyPropType : eFramePropType[] byref *
        ?PropType : eFramePropType
(* Defaults:
        let _PropType = defaultArg PropType
*)
-> int
Parameters
FileName
Type: System.String
The name of the frame section property file from which to get the name list.
In most cases, inputting only the name of the property file (e.g. Sections8.pro) is required, and the program will be able to find it. In some cases, inputting the full path to the property file may be necessary.
NumberNames
Type: System.Int32
The number of frame section property names retrieved by the program.
MyName
Type: System.String[]
This is an array the includes the property names obtained from the frame section property file.
MyPropType
Type: ETABSv1.eFramePropType[]
This is an array the includes the property type for each property obtained from the frame section property file.
PropType (Optional)
Type: ETABSv1.eFramePropType
This optional value is one of the items in the eFramePropType enumeration.
If no value is input for PropType, names are returned for all frame section properties in the specified file regardless of type.
Return Value
Type: Int32
Returns zero if the names are successfully retrieved; otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberNames As Integer
       Dim MyName() As String
       Dim MyPropType() As eFramePropType
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get frame section property names
       ret = SapModel.PropFrame.GetPropFileNameList("Sections8.pro", NumberNames, MyName, MyPropType, eFramePropType.I)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace